Repository: axiaoxin-com/pink-lady
Catalog: statics/i18n/*/LC_MESSAGES/messages.po
Languages: bn, hi, th

source: <h1 id="flatpages-使用文档">Flatpages Usage Documents</h1><blockquote><p> Flatpages is a simple and powerful static page management system that supports content writing in Markdown format, automatically generates directories, and provides an aesthetic reading interface.</p></blockquote><h2 id="功能特点"> Functional Features</h2><ul><li> Supports the Markdown format to write content</li><li> Automatically generate article catalogs</li><li> Code highlighting</li><li> Read progress instructions</li><li> Responsive design, support for mobile</li><li> Support article navigation (Previous/Next)</li><li> Support article search</li><li> International support</li></ul><h2 id="使用方法"> How to use</h2><h3 id="1-配置启用"> 1. Configuration Enable</h3><p> Enable flatpages in the configuration file:</p><pre><code>[flatpages]&nbsp; # 是否启用flatpages&nbsp; enable = true&nbsp; # 支持配置多个flatpage目录&nbsp; [[flatpages.dirs]]&nbsp; nav_name = "帮助文档"&nbsp; nav_path = "docs"&nbsp; file_path = "statics/flatpages/docs"&nbsp; # 每页显示的条目数，可选，默认为10&nbsp; page_size = 20&nbsp; &nbsp; # 可以继续添加更多目录配置...&nbsp; </code></pre><h3 id="2-创建文章"> 2. Create an article</h3><p> Create a <code>.md</code> file in the <code>statics/flatpages</code> directory, and write it in the following format:</p><pre><code># 文章标题&nbsp; &nbsp; &gt; 文章描述（会显示在列表页）&nbsp; &nbsp; 正文内容...&nbsp; &nbsp; ## 二级标题&nbsp; &nbsp; ### 三级标题&nbsp; &nbsp; 正文内容...&nbsp; </code></pre><h3 id="3-markdown-格式说明"> 3. Markdown format description</h3><p> Flatpages supports standard Markdown syntax, including:</p><ul><li> Title (H1-H4)</li><li> List (ordered and unordered)</li><li> Code block (supports syntax highlighting)</li><li> Reference block</li><li> Link</li><li> picture</li><li> Inline code</li></ul><p> Code block example:</p><pre><code>def hello():&nbsp; print("Hello, World!")&nbsp; </code></pre><h3 id="4-特殊功能"> 4. Special functions</h3><h4 id="代码复制"> Code copy</h4><p> The copy button will be automatically added to the upper right corner of all code blocks to facilitate users to copy the code.</p><h4 id="目录导航"> Directory Navigation</h4><p> The system will automatically generate a directory based on the title of the article (H2-H4) and display it on the right. Directory support:</p><ul><li> Automatically highlight the current reading position</li><li> Click to jump</li><li> Scroll synchronization</li></ul><h4 id="阅读进度"> Reading progress</h4><p> A reading progress bar will be displayed at the top of the page, which will visually display the reading position.</p><h2 id="实现原理"> Implementation principle</h2><h3 id="1-文件系统"> 1. File system</h3><p> Flatpages uses Go&#39;s <code>embed.FS</code> to manage static files:</p><pre><code>//go:embed flatpages/*&nbsp; var Files embed.FS&nbsp; </code></pre><h3 id="2-路由注册"> 2. Routing registration</h3><p> The system registers the relevant routes through the <code>InitFlatpages</code> function at startup:</p><ul><li> <code>/fp/</code> - Article list page</li><li> <code>/fp/:slug</code> - Article details page</li></ul><h3 id="3-markdown-解析"> 3. Markdown analysis</h3><p> Use <code>gomarkdown/markdown</code> package for Markdown parsing, support:</p><ul><li> CommonExtensions</li><li> AutoHeadingIDs</li><li> HrefTargetBlank</li></ul><h3 id="4-文章管理"> 4. Article management</h3><p> All Markdown files will be loaded at startup:</p><ol><li> Resolve filename as URL slug</li><li> Extract the article title (H1)</li><li> Extract the article description (first citation block)</li><li> Calculate reading time</li><li> Record update time</li></ol><h3 id="5-搜索实现"> 5. Search implementation</h3><p> The search function of list pages is implemented in JavaScript, which supports real-time search of titles and descriptions.</p><h3 id="6-国际化支持"> 6. International support</h3><p> The system integrates i18n support, and multilingual support can be enabled through configuration:</p><pre><code>[i18n]&nbsp; enable = true&nbsp; </code></pre><h2 id="最佳实践"> Best Practices</h2><ol><li> <strong>File Naming</strong><ul><li> Use a meaningful filename, which will be used as part of the URL</li><li> Avoid special characters and spaces</li><li> Lowercase letters and hyphens are recommended</li></ul></li><li> <strong>Content organization</strong><ul><li> Each file must have an H1 title</li><li> Use citation blocks to add article description</li><li> Use secondary and third-level titles reasonably to organize content</li><li> Control the size of a single file, it is recommended to not exceed 1000 lines.</li></ul></li><li> <strong>Image processing</strong><ul><li> The pictures are recommended to be stored in <code>statics/img</code> directory</li><li> Reference images using relative paths</li><li> Compress images to increase loading speed</li></ul></li><li> <strong>Code display</strong><ul><li> Specify the language of the code block to get the correct syntax highlighting</li><li> Add comments to important code</li><li> Make sure the code block is indented correctly</li></ul></li></ol><h2 id="故障排除"> troubleshooting</h2><ol><li> <strong>Page not displayed</strong><ul><li> Check whether <code>flatpages.enable</code> is true in the configuration file</li><li> Confirm that the Markdown file is in the correct directory</li></ul></li><li> <strong>Directory not generated</strong><ul><li> Check whether the article contains a secondary or tertiary title</li><li> Confirm the title is correct (## or ###)</li></ul></li><li> <strong>Style exception</strong><ul><li> Check if Markdown syntax is correct</li><li> Confirm the file encoding is UTF-8</li></ul></li><li> <strong>Invalid search</strong><ul><li> Check the browser console for JavaScript errors</li><li> Confirm that the page JavaScript loads correctly</li></ul></li></ol>
bn: <h1 id="flatpages-使用文档">ফ্ল্যাটপেজ ব্যবহারের নথি</h1><blockquote><p> ফ্ল্যাটপেজগুলি একটি সহজ এবং শক্তিশালী স্ট্যাটিক পৃষ্ঠা পরিচালনা ব্যবস্থা যা মার্কডাউন ফর্ম্যাটে সামগ্রী লেখার সমর্থন করে, স্বয়ংক্রিয়ভাবে ডিরেক্টরি তৈরি করে এবং একটি নান্দনিক পাঠের ইন্টারফেস সরবরাহ করে।</p></blockquote><h2 id="功能特点"> কার্যকরী বৈশিষ্ট্য</h2><ul><li> সামগ্রী লিখতে মার্কডাউন ফর্ম্যাট সমর্থন করে</li><li> স্বয়ংক্রিয়ভাবে নিবন্ধ ক্যাটালগগুলি উত্পন্ন করুন</li><li> কোড হাইলাইটিং</li><li> অগ্রগতি নির্দেশাবলী পড়ুন</li><li> প্রতিক্রিয়াশীল নকশা, মোবাইলের জন্য সমর্থন</li><li> সমর্থন নিবন্ধ নেভিগেশন (পূর্ববর্তী/পরবর্তী)</li><li> সমর্থন নিবন্ধ অনুসন্ধান</li><li> আন্তর্জাতিক সমর্থন</li></ul><h2 id="使用方法"> কিভাবে ব্যবহার করবেন</h2><h3 id="1-配置启用"> 1। কনফিগারেশন সক্ষম</h3><p> কনফিগারেশন ফাইলে ফ্ল্যাটপেজ সক্ষম করুন:</p><pre><code>[flatpages]&nbsp; # 是否启用flatpages&nbsp; enable = true&nbsp; # 支持配置多个flatpage目录&nbsp; [[flatpages.dirs]]&nbsp; nav_name = "帮助文档"&nbsp; nav_path = "docs"&nbsp; file_path = "statics/flatpages/docs"&nbsp; # 每页显示的条目数，可选，默认为10&nbsp; page_size = 20&nbsp; &nbsp; # 可以继续添加更多目录配置...&nbsp; </code></pre><h3 id="2-创建文章"> 2। একটি নিবন্ধ তৈরি করুন</h3><p> <code>statics/flatpages</code> ডিরেক্টরিতে একটি <code>.md</code> ফাইল তৈরি করুন এবং এটি নিম্নলিখিত ফর্ম্যাটে লিখুন:</p><pre><code># 文章标题&nbsp; &nbsp; &gt; 文章描述（会显示在列表页）&nbsp; &nbsp; 正文内容...&nbsp; &nbsp; ## 二级标题&nbsp; &nbsp; ### 三级标题&nbsp; &nbsp; 正文内容...&nbsp; </code></pre><h3 id="3-markdown-格式说明"> 3। মার্কডাউন ফর্ম্যাট বিবরণ</h3><p> ফ্ল্যাটপেজগুলি স্ট্যান্ডার্ড মার্কডাউন সিনট্যাক্স সমর্থন করে, সহ:</p><ul><li> শিরোনাম (এইচ 1-এইচ 4)</li><li> তালিকা (অর্ডার করা এবং আন্ডার্ডারড)</li><li> কোড ব্লক (সিনট্যাক্স হাইলাইটিং সমর্থন করে)</li><li> রেফারেন্স ব্লক</li><li> লিঙ্ক</li><li> ছবি</li><li> ইনলাইন কোড</li></ul><p> কোড ব্লকের উদাহরণ:</p><pre><code>def hello():&nbsp; print("Hello, World!")&nbsp; </code></pre><h3 id="4-特殊功能"> 4। বিশেষ ফাংশন</h3><h4 id="代码复制"> কোড অনুলিপি</h4><p> ব্যবহারকারীদের কোডটি অনুলিপি করার সুবিধার্থে অনুলিপি বোতামটি সমস্ত কোড ব্লকের উপরের ডান কোণে স্বয়ংক্রিয়ভাবে যুক্ত করা হবে।</p><h4 id="目录导航"> ডিরেক্টরি নেভিগেশন</h4><p> সিস্টেমটি স্বয়ংক্রিয়ভাবে নিবন্ধের (H2-H4) শিরোনামের ভিত্তিতে একটি ডিরেক্টরি তৈরি করবে এবং এটি ডানদিকে প্রদর্শন করবে। ডিরেক্টরি সমর্থন:</p><ul><li> স্বয়ংক্রিয়ভাবে বর্তমান পাঠের অবস্থানটি হাইলাইট করুন</li><li> লাফাতে ক্লিক করুন</li><li> স্ক্রোল সিঙ্ক্রোনাইজেশন</li></ul><h4 id="阅读进度"> অগ্রগতি পড়া</h4><p> পৃষ্ঠার শীর্ষে একটি রিডিং প্রগ্রেস বার প্রদর্শিত হবে, যা দৃশ্যমানভাবে পড়ার অবস্থান প্রদর্শন করবে।</p><h2 id="实现原理"> বাস্তবায়ন নীতি</h2><h3 id="1-文件系统"> 1। ফাইল সিস্টেম</h3><p> স্ট্যাটিক ফাইলগুলি পরিচালনা করতে ফ্ল্যাটপেজগুলি GO এর <code>embed.FS</code> ব্যবহার করে:</p><pre><code>//go:embed flatpages/*&nbsp; var Files embed.FS&nbsp; </code></pre><h3 id="2-路由注册"> 2। রাউটিং রেজিস্ট্রেশন</h3><p> সিস্টেম স্টার্টআপে <code>InitFlatpages</code> ফাংশনের মাধ্যমে প্রাসঙ্গিক রুটগুলি নিবন্ধভুক্ত করে:</p><ul><li> <code>/fp/</code> - নিবন্ধের তালিকা পৃষ্ঠা</li><li> <code>/fp/:slug</code> - নিবন্ধের বিশদ পৃষ্ঠা</li></ul><h3 id="3-markdown-解析"> 3। মার্কডাউন বিশ্লেষণ</h3><p> মার্কডাউন পার্সিংয়ের জন্য <code>gomarkdown/markdown</code> প্যাকেজটি ব্যবহার করুন, সমর্থন:</p><ul><li> কমোনেক্সটেনশনস</li><li> অটোহেডিংআইডিএস</li><li> Hreffargetblank</li></ul><h3 id="4-文章管理"> 4। নিবন্ধ পরিচালনা</h3><p> সমস্ত মার্কডাউন ফাইল স্টার্টআপে লোড করা হবে:</p><ol><li> ইউআরএল স্লাগ হিসাবে ফাইলের নাম সমাধান করুন</li><li> নিবন্ধের শিরোনাম বের করুন (এইচ 1)</li><li> নিবন্ধের বিবরণ বের করুন (প্রথম উদ্ধৃতি ব্লক)</li><li> পড়ার সময় গণনা করুন</li><li> রেকর্ড আপডেটের সময়</li></ol><h3 id="5-搜索实现"> 5। অনুসন্ধান বাস্তবায়ন</h3><p> তালিকা পৃষ্ঠাগুলির অনুসন্ধান ফাংশনটি জাভাস্ক্রিপ্টে প্রয়োগ করা হয়েছে, যা শিরোনাম এবং বর্ণনার রিয়েল-টাইম অনুসন্ধানকে সমর্থন করে।</p><h3 id="6-国际化支持"> 6। আন্তর্জাতিক সমর্থন</h3><p> সিস্টেমটি আই 18 এন সমর্থনকে সংহত করে এবং বহুভাষিক সমর্থন কনফিগারেশনের মাধ্যমে সক্ষম করা যেতে পারে:</p><pre><code>[i18n]&nbsp; enable = true&nbsp; </code></pre><h2 id="最佳实践"> সেরা অনুশীলন</h2><ol><li> <strong>ফাইল নামকরণ</strong><ul><li> একটি অর্থবহ ফাইলের নাম ব্যবহার করুন, যা ইউআরএল এর অংশ হিসাবে ব্যবহৃত হবে</li><li> বিশেষ অক্ষর এবং স্পেস এড়িয়ে চলুন</li><li> লোয়ারকেস অক্ষর এবং হাইফেনগুলি সুপারিশ করা হয়</li></ul></li><li> <strong>বিষয়বস্তু সংস্থা</strong><ul><li> প্রতিটি ফাইলের অবশ্যই একটি এইচ 1 শিরোনাম থাকতে হবে</li><li> নিবন্ধের বিবরণ যুক্ত করতে উদ্ধৃতি ব্লক ব্যবহার করুন</li><li> সামগ্রী সংগঠিত করতে যুক্তিসঙ্গতভাবে মাধ্যমিক এবং তৃতীয় স্তরের শিরোনাম ব্যবহার করুন</li><li> একটি একক ফাইলের আকার নিয়ন্ত্রণ করুন, এটি 1000 লাইনের বেশি না হওয়ার পরামর্শ দেওয়া হয়।</li></ul></li><li> <strong>চিত্র প্রক্রিয়াকরণ</strong><ul><li> ছবিগুলি <code>statics/img</code> ডিরেক্টরিতে সংরক্ষণ করার পরামর্শ দেওয়া হয়</li><li> আপেক্ষিক পাথ ব্যবহার করে রেফারেন্স চিত্রগুলি</li><li> লোডিং গতি বাড়ানোর জন্য চিত্রগুলি সংকুচিত করুন</li></ul></li><li> <strong>কোড প্রদর্শন</strong><ul><li> সঠিক সিনট্যাক্স হাইলাইটিং পেতে কোড ব্লকের ভাষা নির্দিষ্ট করুন</li><li> গুরুত্বপূর্ণ কোডে মন্তব্য যুক্ত করুন</li><li> কোড ব্লকটি সঠিকভাবে ইন্টেন্টেড রয়েছে তা নিশ্চিত করুন</li></ul></li></ol><h2 id="故障排除"> সমস্যা সমাধান</h2><ol><li> <strong>পৃষ্ঠা প্রদর্শিত হয়নি</strong><ul><li> কনফিগারেশন ফাইলে <code>flatpages.enable</code> সত্য কিনা তা পরীক্ষা করে দেখুন</li><li> নিশ্চিত করুন যে মার্কডাউন ফাইলটি সঠিক ডিরেক্টরিতে রয়েছে</li></ul></li><li> <strong>ডিরেক্টরি উত্পন্ন হয় না</strong><ul><li> নিবন্ধটিতে একটি গৌণ বা তৃতীয় শিরোনাম রয়েছে কিনা তা পরীক্ষা করে দেখুন</li><li> নিশ্চিত করুন শিরোনামটি সঠিক (## বা ###)</li></ul></li><li> <strong>স্টাইল ব্যতিক্রম</strong><ul><li> মার্কডাউন সিনট্যাক্সটি সঠিক কিনা তা পরীক্ষা করুন</li><li> ফাইল এনকোডিংটি ইউটিএফ -8 রয়েছে তা নিশ্চিত করুন</li></ul></li><li> <strong>অবৈধ অনুসন্ধান</strong><ul><li> জাভাস্ক্রিপ্ট ত্রুটির জন্য ব্রাউজার কনসোলটি পরীক্ষা করুন</li><li> নিশ্চিত করুন যে পৃষ্ঠাটি জাভাস্ক্রিপ্টটি সঠিকভাবে লোড হয়েছে</li></ul></li></ol>
hi: <h1 id="flatpages-使用文档">फ्लैटपेज उपयोग दस्तावेज</h1><blockquote><p> फ्लैटपेज एक सरल और शक्तिशाली स्थिर पृष्ठ प्रबंधन प्रणाली है जो मार्कडाउन प्रारूप में सामग्री लेखन का समर्थन करती है, स्वचालित रूप से निर्देशिकाएं उत्पन्न करती है, और एक सौंदर्य रीडिंग इंटरफ़ेस प्रदान करती है।</p></blockquote><h2 id="功能特点"> कार्यात्मक विशेषताएं</h2><ul><li> सामग्री लिखने के लिए मार्कडाउन प्रारूप का समर्थन करता है</li><li> स्वचालित रूप से लेख कैटलॉग उत्पन्न करें</li><li> कोड हाइलाइटिंग</li><li> प्रगति निर्देश पढ़ें</li><li> उत्तरदायी डिजाइन, मोबाइल के लिए समर्थन</li><li> समर्थन लेख नेविगेशन (पिछला/अगला)</li><li> समर्थन लेख खोज</li><li> अंतर्राष्ट्रीय समर्थन</li></ul><h2 id="使用方法"> का उपयोग कैसे करें</h2><h3 id="1-配置启用"> 1। कॉन्फ़िगरेशन सक्षम करें</h3><p> कॉन्फ़िगरेशन फ़ाइल में फ्लैटपेज सक्षम करें:</p><pre><code>[flatpages]&nbsp; # 是否启用flatpages&nbsp; enable = true&nbsp; # 支持配置多个flatpage目录&nbsp; [[flatpages.dirs]]&nbsp; nav_name = "帮助文档"&nbsp; nav_path = "docs"&nbsp; file_path = "statics/flatpages/docs"&nbsp; # 每页显示的条目数，可选，默认为10&nbsp; page_size = 20&nbsp; &nbsp; # 可以继续添加更多目录配置...&nbsp; </code></pre><h3 id="2-创建文章"> 2। एक लेख बनाएं</h3><p> <code>statics/flatpages</code> निर्देशिका में एक <code>.md</code> फ़ाइल बनाएं, और इसे निम्न प्रारूप में लिखें:</p><pre><code># 文章标题&nbsp; &nbsp; &gt; 文章描述（会显示在列表页）&nbsp; &nbsp; 正文内容...&nbsp; &nbsp; ## 二级标题&nbsp; &nbsp; ### 三级标题&nbsp; &nbsp; 正文内容...&nbsp; </code></pre><h3 id="3-markdown-格式说明"> 3। मार्कडाउन प्रारूप विवरण</h3><p> फ्लैटपेज मानक मार्कडाउन सिंटैक्स का समर्थन करता है, जिसमें शामिल हैं:</p><ul><li> शीर्षक (H1-H4)</li><li> सूची (आदेशित और अनियंत्रित)</li><li> कोड ब्लॉक (सिंटैक्स हाइलाइटिंग का समर्थन करता है)</li><li> संदर्भ खंड</li><li> जोड़ना</li><li> चित्र</li><li> इनलाइन कोड</li></ul><p> कोड ब्लॉक उदाहरण:</p><pre><code>def hello():&nbsp; print("Hello, World!")&nbsp; </code></pre><h3 id="4-特殊功能"> 4। विशेष कार्य</h3><h4 id="代码复制"> कोड प्रति</h4><p> कोड को कॉपी करने के लिए उपयोगकर्ताओं को सुविधाजनक बनाने के लिए सभी कोड ब्लॉकों के ऊपरी दाएं कोने में कॉपी बटन को स्वचालित रूप से जोड़ा जाएगा।</p><h4 id="目录导航"> निर्देशिका नेविगेशन</h4><p> सिस्टम स्वचालित रूप से लेख (H2-H4) के शीर्षक के आधार पर एक निर्देशिका उत्पन्न करेगा और इसे दाईं ओर प्रदर्शित करेगा। निर्देशिका समर्थन:</p><ul><li> वर्तमान पढ़ने की स्थिति को स्वचालित रूप से हाइलाइट करें</li><li> कूदने के लिए क्लिक करें</li><li> स्क्रॉल सिंक्रनाइज़ेशन</li></ul><h4 id="阅读进度"> पठन प्रगति</h4><p> एक पठन प्रगति बार पृष्ठ के शीर्ष पर प्रदर्शित किया जाएगा, जो नेत्रहीन रूप से पढ़ने की स्थिति प्रदर्शित करेगा।</p><h2 id="实现原理"> कार्यान्वयन सिद्धांत</h2><h3 id="1-文件系统"> 1। फ़ाइल प्रणाली</h3><p> फ्लैटपेज स्थैतिक फ़ाइलों का प्रबंधन करने के लिए GO के <code>embed.FS</code> का उपयोग करता है:</p><pre><code>//go:embed flatpages/*&nbsp; var Files embed.FS&nbsp; </code></pre><h3 id="2-路由注册"> 2। रूटिंग पंजीकरण</h3><p> सिस्टम स्टार्टअप में <code>InitFlatpages</code> फ़ंक्शन के माध्यम से संबंधित मार्गों को पंजीकृत करता है:</p><ul><li> <code>/fp/</code> - अनुच्छेद सूची पृष्ठ</li><li> <code>/fp/:slug</code> - अनुच्छेद विवरण पृष्ठ</li></ul><h3 id="3-markdown-解析"> 3। मार्कडाउन विश्लेषण</h3><p> मार्कडाउन पार्सिंग के लिए <code>gomarkdown/markdown</code> पैकेज का उपयोग करें, समर्थन:</p><ul><li> कमान -पत्र</li><li> ऑटोहेडिंगिड्स</li><li> Hreftargetblank</li></ul><h3 id="4-文章管理"> 4। अनुच्छेद प्रबंधन</h3><p> सभी मार्कडाउन फ़ाइलों को स्टार्टअप पर लोड किया जाएगा:</p><ol><li> URL स्लग के रूप में फ़ाइल नाम को हल करें</li><li> लेख शीर्षक (H1) निकालें</li><li> लेख विवरण (पहला उद्धरण ब्लॉक) निकालें</li><li> पढ़ने के समय की गणना करें</li><li> रिकॉर्ड अद्यतन समय</li></ol><h3 id="5-搜索实现"> 5। खोज कार्यान्वयन</h3><p> सूची पृष्ठों का खोज फ़ंक्शन जावास्क्रिप्ट में लागू किया गया है, जो शीर्षक और विवरणों की वास्तविक समय की खोज का समर्थन करता है।</p><h3 id="6-国际化支持"> 6। अंतर्राष्ट्रीय समर्थन</h3><p> सिस्टम I18N समर्थन को एकीकृत करता है, और बहुभाषी समर्थन कॉन्फ़िगरेशन के माध्यम से सक्षम किया जा सकता है:</p><pre><code>[i18n]&nbsp; enable = true&nbsp; </code></pre><h2 id="最佳实践"> सर्वोत्तम प्रथाएं</h2><ol><li> <strong>फ़ाइल नामकरण</strong><ul><li> एक सार्थक फ़ाइल नाम का उपयोग करें, जिसका उपयोग URL के हिस्से के रूप में किया जाएगा</li><li> विशेष पात्रों और रिक्त स्थान से बचें</li><li> लोअरकेस अक्षरों और हाइफ़न की सिफारिश की जाती है</li></ul></li><li> <strong>सामग्री संगठन</strong><ul><li> प्रत्येक फ़ाइल में H1 शीर्षक होना चाहिए</li><li> लेख विवरण जोड़ने के लिए उद्धरण ब्लॉकों का उपयोग करें</li><li> सामग्री को व्यवस्थित करने के लिए माध्यमिक और तीसरे स्तर के शीर्षक का यथोचित उपयोग करें</li><li> एकल फ़ाइल के आकार को नियंत्रित करें, यह 1000 लाइनों से अधिक नहीं करने की सिफारिश की जाती है।</li></ul></li><li> <strong>मूर्ति प्रोद्योगिकी</strong><ul><li> चित्रों को <code>statics/img</code> निर्देशिका में संग्रहीत करने की सिफारिश की जाती है</li><li> सापेक्ष पथों का उपयोग करके संदर्भ चित्र</li><li> लोडिंग गति बढ़ाने के लिए छवियों को संपीड़ित करें</li></ul></li><li> <strong>कोड प्रदर्शन</strong><ul><li> सही सिंटैक्स हाइलाइटिंग प्राप्त करने के लिए कोड ब्लॉक की भाषा निर्दिष्ट करें</li><li> महत्वपूर्ण कोड में टिप्पणियाँ जोड़ें</li><li> सुनिश्चित करें कि कोड ब्लॉक सही ढंग से इंडेंट किया गया है</li></ul></li></ol><h2 id="故障排除"> समस्या निवारण</h2><ol><li> <strong>पृष्ठ प्रदर्शित नहीं किया गया</strong><ul><li> जांचें कि क्या <code>flatpages.enable</code> कॉन्फ़िगरेशन फ़ाइल में सही है</li><li> पुष्टि करें कि मार्कडाउन फ़ाइल सही निर्देशिका में है</li></ul></li><li> <strong>निर्देशिका उत्पन्न नहीं हुई</strong><ul><li> जांच करें कि क्या लेख में एक माध्यमिक या तृतीयक शीर्षक है</li><li> पुष्टि करें कि शीर्षक सही है (## या ###)</li></ul></li><li> <strong>शैली अपवाद</strong><ul><li> जांचें कि क्या मार्कडाउन सिंटैक्स सही है</li><li> फ़ाइल एन्कोडिंग की पुष्टि करें UTF-8 है</li></ul></li><li> <strong>अमान्य खोज</strong><ul><li> जावास्क्रिप्ट त्रुटियों के लिए ब्राउज़र कंसोल की जाँच करें</li><li> पुष्टि करें कि पृष्ठ जावास्क्रिप्ट सही तरीके से लोड होता है</li></ul></li></ol>
th: <h1 id="flatpages-使用文档">เอกสารการใช้งาน flatpages</h1><blockquote><p> FlatPages เป็นระบบการจัดการหน้าแบบคงที่ที่เรียบง่ายและทรงพลังซึ่งรองรับการเขียนเนื้อหาในรูปแบบ markdown สร้างไดเรกทอรีโดยอัตโนมัติและให้อินเทอร์เฟซการอ่านสุนทรียศาสตร์</p></blockquote><h2 id="功能特点"> คุณสมบัติการใช้งาน</h2><ul><li> รองรับรูปแบบ Markdown เพื่อเขียนเนื้อหา</li><li> สร้างแคตตาล็อกบทความโดยอัตโนมัติ</li><li> การเน้นรหัส</li><li> อ่านคำแนะนำความคืบหน้า</li><li> การออกแบบที่ตอบสนองการสนับสนุนสำหรับมือถือ</li><li> สนับสนุนบทความนำทาง (ก่อนหน้า/ถัดไป)</li><li> สนับสนุนการค้นหาบทความ</li><li> การสนับสนุนระหว่างประเทศ</li></ul><h2 id="使用方法"> วิธีใช้</h2><h3 id="1-配置启用"> 1. เปิดใช้งานการกำหนดค่า</h3><p> เปิดใช้งาน FlatPages ในไฟล์กำหนดค่า:</p><pre><code>[flatpages]&nbsp; # 是否启用flatpages&nbsp; enable = true&nbsp; # 支持配置多个flatpage目录&nbsp; [[flatpages.dirs]]&nbsp; nav_name = "帮助文档"&nbsp; nav_path = "docs"&nbsp; file_path = "statics/flatpages/docs"&nbsp; # 每页显示的条目数，可选，默认为10&nbsp; page_size = 20&nbsp; &nbsp; # 可以继续添加更多目录配置...&nbsp; </code></pre><h3 id="2-创建文章"> 2. สร้างบทความ</h3><p> สร้างไฟล์ <code>.md</code> ในไดเรกทอรี <code>statics/flatpages</code> และเขียนในรูปแบบต่อไปนี้:</p><pre><code># 文章标题&nbsp; &nbsp; &gt; 文章描述（会显示在列表页）&nbsp; &nbsp; 正文内容...&nbsp; &nbsp; ## 二级标题&nbsp; &nbsp; ### 三级标题&nbsp; &nbsp; 正文内容...&nbsp; </code></pre><h3 id="3-markdown-格式说明"> 3. คำอธิบายรูปแบบ Markdown</h3><p> FlatPages รองรับไวยากรณ์ Markdown มาตรฐานรวมถึง:</p><ul><li> ชื่อเรื่อง (H1-H4)</li><li> รายการ (สั่งซื้อและไม่ได้เรียงลำดับ)</li><li> บล็อกรหัส (รองรับการไฮไลต์ไวยากรณ์)</li><li> บล็อกอ้างอิง</li><li> การเชื่อมโยง</li><li> รูปภาพ</li><li> รหัสอินไลน์</li></ul><p> ตัวอย่างบล็อกโค้ด:</p><pre><code>def hello():&nbsp; print("Hello, World!")&nbsp; </code></pre><h3 id="4-特殊功能"> 4. ฟังก์ชั่นพิเศษ</h3><h4 id="代码复制"> การคัดลอกรหัส</h4><p> ปุ่มคัดลอกจะถูกเพิ่มโดยอัตโนมัติไปที่มุมขวาบนของบล็อกรหัสทั้งหมดเพื่ออำนวยความสะดวกให้ผู้ใช้คัดลอกรหัส</p><h4 id="目录导航"> การนำทาง</h4><p> ระบบจะสร้างไดเรกทอรีโดยอัตโนมัติตามชื่อของบทความ (H2-H4) และแสดงทางด้านขวา การสนับสนุนไดเรกทอรี:</p><ul><li> เน้นตำแหน่งการอ่านปัจจุบันโดยอัตโนมัติ</li><li> คลิกเพื่อกระโดด</li><li> การซิงโครไนซ์ม้วน</li></ul><h4 id="阅读进度"> การอ่านความคืบหน้า</h4><p> แถบความคืบหน้าการอ่านจะปรากฏขึ้นที่ด้านบนของหน้าซึ่งจะแสดงตำแหน่งการอ่านด้วยสายตา</p><h2 id="实现原理"> หลักการดำเนินการ</h2><h3 id="1-文件系统"> 1. ระบบไฟล์</h3><p> FlatPages ใช้ GO&#39;s <code>embed.FS</code> เพื่อจัดการไฟล์คงที่:</p><pre><code>//go:embed flatpages/*&nbsp; var Files embed.FS&nbsp; </code></pre><h3 id="2-路由注册"> 2. การลงทะเบียนเส้นทาง</h3><p> ระบบจะลงทะเบียนเส้นทางที่เกี่ยวข้องผ่านฟังก์ชั่น <code>InitFlatpages</code> เมื่อเริ่มต้น:</p><ul><li> <code>/fp/</code> - หน้ารายการบทความ</li><li> <code>/fp/:slug</code> - หน้ารายละเอียดบทความ</li></ul><h3 id="3-markdown-解析"> 3. การวิเคราะห์ Markdown</h3><p> ใช้แพ็คเกจ <code>gomarkdown/markdown</code> สำหรับการแยกวิเคราะห์ Markdown สนับสนุน:</p><ul><li> commonextensions</li><li> AutoheadingIds</li><li> HreftargetBlank</li></ul><h3 id="4-文章管理"> 4. การจัดการบทความ</h3><p> ไฟล์ Markdown ทั้งหมดจะถูกโหลดเมื่อเริ่มต้น:</p><ol><li> แก้ไขชื่อไฟล์เป็น URL Slug</li><li> แยกชื่อบทความ (H1)</li><li> แยกคำอธิบายบทความ (บล็อกการอ้างอิงครั้งแรก)</li><li> คำนวณเวลาการอ่าน</li><li> บันทึกเวลาอัปเดต</li></ol><h3 id="5-搜索实现"> 5. การใช้งานการค้นหา</h3><p> ฟังก์ชั่นการค้นหาของหน้ารายการถูกนำไปใช้ใน JavaScript ซึ่งรองรับการค้นหาชื่อและคำอธิบายแบบเรียลไทม์</p><h3 id="6-国际化支持"> 6. การสนับสนุนระหว่างประเทศ</h3><p> ระบบรวมการสนับสนุน I18N และการสนับสนุนหลายภาษาสามารถเปิดใช้งานได้ผ่านการกำหนดค่า:</p><pre><code>[i18n]&nbsp; enable = true&nbsp; </code></pre><h2 id="最佳实践"> แนวทางปฏิบัติที่ดีที่สุด</h2><ol><li> <strong>การตั้งชื่อไฟล์</strong><ul><li> ใช้ชื่อไฟล์ที่มีความหมายซึ่งจะใช้เป็นส่วนหนึ่งของ URL</li><li> หลีกเลี่ยงอักขระและช่องว่างพิเศษ</li><li> แนะนำให้ใช้ตัวอักษรตัวพิมพ์เล็กและยัติภังค์</li></ul></li><li> <strong>องค์กรเนื้อหา</strong><ul><li> แต่ละไฟล์ต้องมีชื่อ H1</li><li> ใช้บล็อกการอ้างอิงเพื่อเพิ่มคำอธิบายบทความ</li><li> ใช้ชื่อเรื่องระดับมัธยมศึกษาและระดับที่สามอย่างสมเหตุสมผลในการจัดระเบียบเนื้อหา</li><li> ควบคุมขนาดของไฟล์เดียวขอแนะนำให้ไม่เกิน 1,000 บรรทัด</li></ul></li><li> <strong>การประมวลผลภาพ</strong><ul><li> รูปภาพจะแนะนำให้เก็บไว้ในไดเรกทอรี <code>statics/img</code></li><li> ภาพอ้างอิงโดยใช้เส้นทางสัมพัทธ์</li><li> บีบอัดภาพเพื่อเพิ่มความเร็วในการโหลด</li></ul></li><li> <strong>การแสดงรหัส</strong><ul><li> ระบุภาษาของบล็อกรหัสเพื่อรับการเน้นไวยากรณ์ที่ถูกต้อง</li><li> เพิ่มความคิดเห็นในรหัสสำคัญ</li><li> ตรวจสอบให้แน่ใจว่าบล็อกรหัสนั้นมีการเยื้องอย่างถูกต้อง</li></ul></li></ol><h2 id="故障排除"> การแก้ไขปัญหา</h2><ol><li> <strong>หน้าไม่ปรากฏ</strong><ul><li> ตรวจสอบว่า <code>flatpages.enable</code> เป็นจริงในไฟล์การกำหนดค่า</li><li> ยืนยันว่าไฟล์ Markdown อยู่ในไดเรกทอรีที่ถูกต้อง</li></ul></li><li> <strong>ไม่ได้สร้างไดเรกทอรี</strong><ul><li> ตรวจสอบว่าบทความมีชื่อรองหรือระดับตติยภูมิ</li><li> ยืนยันว่าชื่อถูกต้อง (## หรือ ###)</li></ul></li><li> <strong>ข้อยกเว้นสไตล์</strong><ul><li> ตรวจสอบว่ามาร์คดาวน์ไวยากรณ์ถูกต้องหรือไม่</li><li> ยืนยันการเข้ารหัสไฟล์คือ UTF-8</li></ul></li><li> <strong>การค้นหาที่ไม่ถูกต้อง</strong><ul><li> ตรวจสอบข้อผิดพลาดของเบราว์เซอร์สำหรับข้อผิดพลาด JavaScript</li><li> ยืนยันว่าหน้า JavaScript โหลดอย่างถูกต้อง</li></ul></li></ol>

# Flatpages 使用文档
source: Flatpages Usage Documents
bn: ফ্ল্যাটপেজ ব্যবহারের নথি
hi: फ्लैटपेज उपयोग दस्तावेज
th: เอกสารการใช้งาน flatpages

# Flatpages 是一个简单而强大的静态页面管理系统，支持 Markdown 格式的内容编写，自动生成目录，并提供美观的阅读界面。
source: Flatpages is a simple and powerful static page management system that supports content writing in Markdown format, automatically generates directories, and provides an aesthetic reading interface.
bn: ফ্ল্যাটপেজগুলি একটি সহজ এবং শক্তিশালী স্ট্যাটিক পৃষ্ঠা পরিচালনা ব্যবস্থা যা মার্কডাউন ফর্ম্যাটে সামগ্রী লেখার সমর্থন করে, স্বয়ংক্রিয়ভাবে ডিরেক্টরি তৈরি করে এবং একটি নান্দনিক পাঠের ইন্টারফেস সরবরাহ করে।
hi: फ्लैटपेज एक सरल और शक्तिशाली स्थिर पृष्ठ प्रबंधन प्रणाली है जो मार्कडाउन प्रारूप में सामग्री लेखन का समर्थन करती है, स्वचालित रूप से निर्देशिकाएं उत्पन्न करती है, और एक सौंदर्य रीडिंग इंटरफ़ेस प्रदान करती है।
th: FlatPages เป็นระบบการจัดการหน้าแบบคงที่ที่เรียบง่ายและทรงพลังซึ่งรองรับการเขียนเนื้อหาในรูปแบบ markdown สร้างไดเรกทอรีโดยอัตโนมัติและให้อินเทอร์เฟซการอ่านสุนทรียศาสตร์

# golang web开发框架
source: golang web development framework
bn: গোলং ওয়েব উন্নয়ন কাঠামো
hi: गोलांग वेब विकास ढांचा
th: กรอบการพัฒนาเว็บของ Golang
