Repository: axiaoxin-com/pink-lady
Catalog: statics/i18n/*/LC_MESSAGES/messages.po
Languages: bn, hi, th

# pink-lady是一个golang gin的web开发模板
source: pink-lady is a golang gin web development template
bn: গোলাপী লেডি একটি গোলং জিন ওয়েব ডেভলপমেন্ট টেম্পলেট
hi: पिंक-लेडी एक गोलंग जिन वेब डेवलपमेंट टेम्पलेट है
th: Pink-Lady เป็นเทมเพลตการพัฒนาเว็บ Golang Gin

# 上一篇
source: Previous article
bn: পূর্ববর্তী নিবন্ধ
hi: पिछला लेख
th: บทความก่อนหน้า

# 下一篇
source: Next article
bn: পরবর্তী নিবন্ধ
hi: अगला लेख
th: บทความถัดไป

# 主页
source: Home page
bn: হোম পেজ
hi: गृह पृष्ठ
th: โฮมเพจ

# 关于
source: about
bn: সম্পর্কে
hi: के बारे में
th: เกี่ยวกับ

# 关于我们
source: about Us
bn: আমাদের সম্পর্কে
hi: हमारे बारे में
th: เกี่ยวกับเรา

# 关于网站
source: About the website
bn: ওয়েবসাইট সম্পর্কে
hi: वेबसाइट के बारे में
th: เกี่ยวกับเว็บไซต์

# 分钟
source: minute
bn: মিনিট
hi: मिनट
th: นาที

# 分钟前
source: Minutes ago
bn: মিনিট আগে
hi: कुछ मिनट पहले
th: นาทีที่ผ่านมา

# 复制
source: copy
bn: অনুলিপি
hi: कॉपी
th: สำเนา

# 天前
source: Day ago
bn: দিন আগে
hi: दिन पहले
th: วันที่ผ่านมา

# 如果网站对您有所帮助，有条件的朋友愿意打赏，可以扫描下方二维码赞助本站。赞赏款项将用于服务器、域名等固定支出，我们会定期将您的赞赏更新到赞赏记录中。
source: If the website is helpful to you and friends who have the conditions are willing to give it a reward, you can scan the QR code below to sponsor this site. The appreciation amount will be used for fixed expenses such as servers, domain names, etc., and we will regularly update your appreciation to the appreciation record.
bn: যদি ওয়েবসাইটটি আপনার এবং যে বন্ধুরা শর্ত রয়েছে তাদের পক্ষে এটি একটি পুরষ্কার দিতে ইচ্ছুক হয় তবে আপনি এই সাইটটিকে স্পনসর করতে নীচের কিউআর কোডটি স্ক্যান করতে পারেন। প্রশংসার পরিমাণটি সার্ভার, ডোমেন নাম ইত্যাদির মতো স্থির ব্যয়ের জন্য ব্যবহৃত হবে এবং আমরা নিয়মিত প্রশংসা রেকর্ডে আপনার প্রশংসা আপডেট করব।
hi: यदि वेबसाइट आपके और उन दोस्तों के लिए सहायक है, जिनके पास स्थितियां हैं, तो वे इसे इनाम देने के लिए तैयार हैं, आप इस साइट को प्रायोजित करने के लिए नीचे दिए गए क्यूआर कोड को स्कैन कर सकते हैं। सराहना राशि का उपयोग निश्चित खर्चों जैसे कि सर्वर, डोमेन नाम आदि के लिए किया जाएगा, और हम नियमित रूप से आपकी प्रशंसा को प्रशंसा रिकॉर्ड के लिए अपडेट करेंगे।
th: หากเว็บไซต์มีประโยชน์สำหรับคุณและเพื่อน ๆ ที่มีเงื่อนไขยินดีที่จะให้รางวัลคุณสามารถสแกนรหัส QR ด้านล่างเพื่อสนับสนุนเว็บไซต์นี้ จำนวนเงินชื่นชมจะถูกใช้สำหรับค่าใช้จ่ายคงที่เช่นเซิร์ฟเวอร์ชื่อโดเมน ฯลฯ และเราจะอัปเดตการชื่นชมของคุณเป็นประจำในบันทึกการชื่นชม

# 导航菜单
source: Navigation menu
bn: নেভিগেশন মেনু
hi: नेविगेशन मेनू
th: เมนูนำทาง

# 小时前
source: Hour ago
bn: ঘন্টা আগে
hi: घंटेभर पहले
th: ชั่วโมงที่ผ่านมา

# 展开
source: Expand
bn: প্রসারিত
hi: बढ़ाना
th: ขยาย

# 已复制
source: Copyed
bn: অনুলিপি
hi: प्रति
th: ที่คัดลอกมา

# 帮助文档
source: Help Documentation
bn: ডকুমেন্টেশন সাহায্য করুন
hi: सहायता प्रलेखन
th: ช่วยเหลือเอกสาร

# 微信
source: WeChat
bn: ওয়েচ্যাট

# 您也可以通过点击网页上的广告这种免费的方式来帮助我们存活下去，让我们能够持续创作更多优质内容！
source: You can also help us survive by clicking on ads on the web page, allowing us to continue to create more high-quality content!
bn: আপনি ওয়েব পৃষ্ঠায় বিজ্ঞাপনগুলিতে ক্লিক করে আমাদের বেঁচে থাকতে সহায়তা করতে পারেন, আমাদের আরও উচ্চমানের সামগ্রী তৈরি চালিয়ে যেতে দেয়!
hi: आप वेब पेज पर विज्ञापनों पर क्लिक करके हमें जीवित रहने में भी मदद कर सकते हैं, जिससे हमें अधिक उच्च गुणवत्ता वाली सामग्री बनाने की अनुमति मिलती है!
th: นอกจากนี้คุณยังสามารถช่วยเราให้รอดชีวิตได้โดยคลิกที่โฆษณาบนหน้าเว็บทำให้เราสามารถสร้างเนื้อหาที่มีคุณภาพสูงได้มากขึ้น!

# 感谢
source: grateful
bn: কৃতজ্ঞ
hi: आभारी
th: ปลื้มปีติ

# 提交失败，请稍后再试！
source: Submission failed, please try again later!
bn: জমা দেওয়া ব্যর্থ হয়েছে, দয়া করে আবার চেষ্টা করুন!
hi: सबमिशन विफल हो गया, कृपया बाद में पुनः प्रयास करें!
th: การส่งล้มเหลวโปรดลองอีกครั้งในภายหลัง!

# 搜索
source: search
bn: অনুসন্ধান
hi: खोज
th: ค้นหา

# 操作失败！
source: Operation failed!
bn: অপারেশন ব্যর্থ!
hi: प्रचालन विफल रहा!
th: การดำเนินการล้มเหลว!

# 支付宝
source: Alipay
bn: আলিপে
hi: अलीपे
th: Aliipay

# 收起
source: Close
bn: বন্ধ
hi: बंद करना
th: ปิด

# 文字
source: character
bn: চরিত্র
hi: चरित्र
th: อักขระ

# 时间
source: time
bn: সময়
hi: समय
th: เวลา

# 更多
source: More
bn: আরও
hi: अधिक
th: มากกว่า

# 欢迎您将网站分享推荐给您的朋友，让更多的人受益，感谢您为本站出一份力，谢谢大家！
source: Welcome to share and recommend the website to your friends to benefit more people. Thank you for your contribution to this site, thank you everyone!
bn: আরও বেশি লোকের উপকারের জন্য আপনার বন্ধুদের কাছে ওয়েবসাইটটি ভাগ করে নেওয়ার জন্য স্বাগতম। এই সাইটে আপনার অবদানের জন্য আপনাকে ধন্যবাদ, সবাইকে ধন্যবাদ!
hi: अधिक लोगों को लाभान्वित करने के लिए अपने दोस्तों को वेबसाइट साझा करने और अनुशंसा करने के लिए आपका स्वागत है। इस साइट में आपके योगदान के लिए धन्यवाद, आप सभी को धन्यवाद!
th: ยินดีต้อนรับสู่การแบ่งปันและแนะนำเว็บไซต์ให้เพื่อนของคุณเพื่อเป็นประโยชน์ต่อผู้คนมากขึ้น ขอบคุณสำหรับการบริจาคเว็บไซต์นี้ขอบคุณทุกคน!

# 温馨提示！
source: Kind tips!
bn: দয়ালু টিপস!
hi: दयालु युक्तियाँ!
th: เคล็ดลับชนิด!

# 源码
source: Source code
bn: উত্স কোড
hi: सोर्स कोड
th: รหัสต้นฉบับ

# 留言
source: message
bn: বার্তা
hi: संदेश
th: ข้อความ

# 留言板
source: Message board
bn: বার্তা বোর্ড
hi: संदेश बोर्ड
th: กระดานข้อความ

# 目前本站仍为测试版本，可能会出现维护、停机更新等不稳定的情况，但我们会尽量减少这样的情况发生。
source: At present, this site is still a test version, and there may be unstable situations such as maintenance, downtime and updates, but we will try to minimize such situations.
bn: বর্তমানে, এই সাইটটি এখনও একটি পরীক্ষার সংস্করণ, এবং রক্ষণাবেক্ষণ, ডাউনটাইম এবং আপডেটগুলির মতো অস্থির পরিস্থিতি থাকতে পারে তবে আমরা এই জাতীয় পরিস্থিতি হ্রাস করার চেষ্টা করব।
hi: वर्तमान में, यह साइट अभी भी एक परीक्षण संस्करण है, और रखरखाव, डाउनटाइम और अपडेट जैसी अस्थिर स्थितियां हो सकती हैं, लेकिन हम ऐसी स्थितियों को कम करने का प्रयास करेंगे।
th: ในปัจจุบันเว็บไซต์นี้ยังคงเป็นเวอร์ชันทดสอบและอาจมีสถานการณ์ที่ไม่เสถียรเช่นการบำรุงรักษาการหยุดทำงานและการอัปเดต แต่เราจะพยายามลดสถานการณ์ดังกล่าวให้น้อยที่สุด

# 目录
source: Table of contents
bn: বিষয়বস্তু সারণী
hi: विषयसूची
th: สารบัญ

# 秒钟前
source: Seconds ago
bn: সেকেন্ড আগে
hi: सेकंड पहले
th: วินาทีที่ผ่านมา

# 系统公告
source: System Announcement
bn: সিস্টেম ঘোষণা
hi: तंत्र घोषणा
th: ประกาศระบบ

# 系统错误！
source: System error!
bn: সিস্টেমের ত্রুটি!
hi: सिस्टम त्रुटि!
th: ข้อผิดพลาดของระบบ!

# 系统错误，请稍后重试！
source: System error, please try again later!
bn: সিস্টেম ত্রুটি, দয়া করে পরে আবার চেষ্টা করুন!
hi: सिस्टम त्रुटि, कृपया बाद में पुनः प्रयास करें!
th: ข้อผิดพลาดของระบบโปรดลองอีกครั้งในภายหลัง!

# 语言
source: language
bn: ভাষা
hi: भाषा
th: ภาษา

# 赞赏记录
source: Appreciation record
bn: প্রশংসা রেকর্ড
hi: प्रशंसा अभिलेख
th: บันทึกการชื่นชม

# 返回列表
source: Return to the list
bn: তালিকায় ফিরে আসুন
hi: सूची में लौटें
th: กลับไปที่รายการ

# 金额
source: Amount
bn: পরিমাণ
hi: मात्रा
th: จำนวน

# 阅读全文
source: Read the full text
bn: সম্পূর্ণ পাঠ্য পড়ুন
hi: पूरा पाठ पढ़ें
th: อ่านข้อความฉบับเต็ม

# 首页
source: front page
bn: প্রথম পৃষ্ঠা
hi: मुखपृष्ठ
th: หน้าแรก
